vlm/base/Catalogs/СерииНоменклатурыДляЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатурыДляЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыЦенообразования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗавеса</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗаказа</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Брутто</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТипТары</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Штрихкод</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормативнаяМасса</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Эмалировщик</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Завешено</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_МассаНетто</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Весовщик</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СменаВесовщика</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СменыВесовщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ДатаВремяЗавеса</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Контроллёр</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВидРабочегоЦентра</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Смена</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Перемаркировка</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/СерииНоменклатурыДляЦенообразования/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	СтрокаСписка = Строки.Получить(Ключи[0]);
	Если Не СтрокаСписка.Данные.Свойство("НетСсылкиНаЭлемент") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерииНоменклатуры.СерияНоменклатурыДляЦенообразования Как Ссылка,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА СерииНоменклатуры.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ) КАК НетСсылкиНаЭлемент
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.СерияНоменклатурыДляЦенообразования В (&Ссылки)
		|СГРУППИРОВАТЬ ПО
		|	СерииНоменклатуры.СерияНоменклатурыДляЦенообразования";
		
	Ссылки = Новый Массив;
	Для Каждого Ключ Из Ключи Цикл // СправочникСсылка.СерииНоменклатурыДляЦенообразования
		Ссылки.Добавить(Ключ);
	КонецЦикла;
		
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	ДанныеПоСериям = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из Строки Цикл
		Строка = Строки[Строка.Ключ];
		НайденнаяСтрока = ДанныеПоСериям.Найти(Строка.Данные["Ссылка"], "Ссылка");
		Если НайденнаяСтрока <> Неопределено Тогда
			Строка.Данные["НетСсылкиНаЭлемент"] = НайденнаяСтрока.НетСсылкиНаЭлемент;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти
